; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 69857 1 3 3 3 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image0 - mode
	spectrograph1 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Planet5 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
)
(:goal (and
	(have_image Phenomenon3 image0)
	(have_image Phenomenon4 spectrograph2)
	(have_image Planet5 image0)
))

)

; plan
1. (turn_to satellite0 planet5 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet5)
   goals met: 0 of 3
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 3
3. (turn_to satellite0 groundstation1 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 3
4. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 3
5. (turn_to satellite0 phenomenon4 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon4)
   goals met: 0 of 3
6. (take_image satellite0 phenomenon4 instrument2 spectrograph2)
   added: (have_image phenomenon4 spectrograph2)
   goals met: 1 of 3
7. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 1 of 3
8. (turn_to satellite0 planet5 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 planet5)
   goals met: 1 of 3
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 3
10. (turn_to satellite0 groundstation1 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 3
11. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 3
12. (turn_to satellite0 planet5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet5)
   goals met: 1 of 3
13. (take_image satellite0 planet5 instrument0 image0)
   added: (have_image planet5 image0)
   goals met: 2 of 3
14. (turn_to satellite0 phenomenon3 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon3)
   goals met: 2 of 3
15. (take_image satellite0 phenomenon3 instrument0 image0)
   added: (have_image phenomenon3 image0)
   goals met: 3 of 3
